src/Catalogs/уатМаршруты/уатМаршруты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатМаршруты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВремяВПути</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерМаршрута</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеМаршрутаОднимПунктом</name>
    <comment>Ложь-пары пунктов, Истина-один пункт</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Расстояние</name>
    <comment>Расстояние</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПланированияВАРМЛогиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеРаботы</name>
    <type>
      <types>CatalogRef.уатУсловияРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.уатСтатусыДействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОтправления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветНаКарте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НочнойМаршрут</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Этапы</name>
    <comment>Этапы движения по маршруту</comment>
    <attributes>
      <name>ВремяВПути</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктОтправления</name>
      <comment>Пункт отправления</comment>
      <type>
        <types>CatalogRef.уатПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктПрибытия</name>
      <comment>Пункт прибытия</comment>
      <type>
        <types>CatalogRef.уатПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <comment>Расстояние</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТочиМаршрута</name>
      <type>
        <types>EnumRef.уатТипыТочекМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТранспортныеСредства</name>
    <attributes>
      <name>ТС</name>
      <type>
        <types>CatalogRef.уатТС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/уатТипыТочекМаршрута/уатТипыТочекМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатТипыТочекМаршрута</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>Погрузка</name>
  </enumValues>
  <enumValues>
    <name>ПромежуточныйПункт</name>
  </enumValues>
  <enumValues>
    <name>Разгрузка</name>
  </enumValues>
  <enumValues>
    <name>ДополнительнаяПогрузка</name>
  </enumValues>
  <enumValues>
    <name>ДополнительнаяРазгрузка</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/уатМаршруты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа И ПредставлениеМаршрутаОднимПунктом
		И (уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() ИЛИ уатОбщегоНазначенияПовтИсп.ВариантПоставкиПРОФ()) Тогда
		ПунктПогрузки  = Ложь;
		ПунктРазгрузки = Ложь;
		
		Для Каждого ТекСтрока Из Этапы Цикл
			Если ПунктПогрузки = Ложь
				И ТекСтрока.ТипТочиМаршрута = Перечисления.уатТипыТочекМаршрута.Разгрузка Тогда
				ТекстНстр = Нстр("ru = 'Точка погрузки должна быть выше точки разгрузки.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНстр,,,,Отказ);
				Прервать;
			ИначеЕсли ПунктПогрузки = Ложь И ТекСтрока.ТипТочиМаршрута = Перечисления.уатТипыТочекМаршрута.Погрузка Тогда
				ПунктПогрузки = Истина;
			ИначеЕсли ТекСтрока.ТипТочиМаршрута = Перечисления.уатТипыТочекМаршрута.Разгрузка Тогда
				ПунктРазгрузки = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ Отказ И Этапы.Количество() Тогда
			Если НЕ ПунктПогрузки ИЛИ НЕ ПунктРазгрузки Тогда
				ТекстНстр = Нстр("ru = 'В маршруте должна быть хотя бы 1 точка погрузки и 1 точка разгрузки.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНстр,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЭтоГруппа И уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() И ИспользоватьДляПланированияВАРМЛогиста И Этапы.Количество() > 0 Тогда
		ОшибкаЗаполнения = Ложь;
		Если Этапы[0].ТипТочиМаршрута = Перечисления.уатТипыТочекМаршрута.Погрузка Тогда
			Сч = 1;
			Пока Сч <> Этапы.Количество() Цикл
				Если Этапы[Сч].ТипТочиМаршрута = Перечисления.уатТипыТочекМаршрута.Разгрузка Тогда
					Сч = Сч +1;
				Иначе
					ОшибкаЗаполнения = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ОшибкаЗаполнения = Истина;
		КонецЕсли;
		
		Если ОшибкаЗаполнения Тогда
			Отказ = Истина;
			ТекстНстр = НСтр("ru='Маршрут для планирования в АРМ Логиста заполнен некорректно. Проверьте заполнение операций.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНстр,,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЭтоГруппа И уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() И ИспользоватьДляПланированияВАРМЛогиста Тогда
		КоличествоТС = ТранспортныеСредства.Количество();
		ТаблицаТС = ТранспортныеСредства.Выгрузить(, "ТС");
		ТаблицаТС.Свернуть("ТС");
		КоличествоРазличныхТС = ТаблицаТС.Количество();
		Если КоличествоТС <> КоличествоРазличныхТС Тогда
			Отказ = Истина;
			ТекстНстр = НСтр("ru='Необходимо удалить дубликаты из списка закрепленных за маршрутом ТС.'; 
				|en = 'All duplicate vehicles should be removed.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНстр,,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
